{
  "Avg. Length": 90.0683942349687,
  "LSTM": 2,
  "_name_or_path": "../models/env-albert/",
  "architectures": [
    "AlbertCRF"
  ],
  "attention_probs_dropout_prob": 0.0,
  "bos_token_id": 2,
  "classifier_dropout_prob": 0.1,
  "contact": "bi.huaibin@foxmail.com",
  "counter": {
    "a": 11497,
    "act": 12722,
    "animal": 2108,
    "b": 11531,
    "c": 1870,
    "code": 1814,
    "com": 3896,
    "conj": 46815,
    "d": 48080,
    "desease": 1551,
    "doc": 6630,
    "env": 25374,
    "event": 1127,
    "f": 16576,
    "gov": 8032,
    "group": 8328,
    "hy": 6218,
    "ins": 5239,
    "loc": 14777,
    "m": 22841,
    "means": 3723,
    "med": 9436,
    "meet": 1637,
    "microbe": 939,
    "n": 42781,
    "ord": 4912,
    "org": 862,
    "p": 27463,
    "per": 5100,
    "phe": 3987,
    "plant": 1322,
    "pol": 14686,
    "policy": 6511,
    "pro": 6420,
    "q": 8487,
    "r": 17569,
    "time": 10236,
    "u": 48314,
    "v": 110814,
    "vn": 23115,
    "w": 82524,
    "xc": 1109
  },
  "down_scale_factor": 1,
  "embedding_size": 128,
  "entities": [
    "pol",
    "d",
    "p",
    "v",
    "xc",
    "u",
    "group",
    "r",
    "f",
    "w",
    "env",
    "n",
    "doc",
    "a",
    "act",
    "loc",
    "vn",
    "conj",
    "ins",
    "hy",
    "pro",
    "time",
    "gov",
    "med",
    "b",
    "c",
    "com",
    "m",
    "means",
    "microbe",
    "plant",
    "phe",
    "ord",
    "animal",
    "q",
    "desease",
    "per",
    "policy",
    "event",
    "meet",
    "code",
    "org"
  ],
  "entity2id": {
    "a": 13,
    "act": 14,
    "animal": 33,
    "b": 24,
    "c": 25,
    "code": 40,
    "com": 26,
    "conj": 17,
    "d": 1,
    "desease": 35,
    "doc": 12,
    "env": 10,
    "event": 38,
    "f": 8,
    "gov": 22,
    "group": 6,
    "hy": 19,
    "ins": 18,
    "loc": 15,
    "m": 27,
    "means": 28,
    "med": 23,
    "meet": 39,
    "microbe": 29,
    "n": 11,
    "ord": 32,
    "org": 41,
    "p": 2,
    "per": 36,
    "phe": 31,
    "plant": 30,
    "pol": 0,
    "policy": 37,
    "pro": 20,
    "q": 34,
    "r": 7,
    "time": 21,
    "u": 5,
    "v": 3,
    "vn": 16,
    "w": 9,
    "xc": 4
  },
  "eos_token_id": 3,
  "gap_size": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 312,
  "id2entity": {
    "0": "pol",
    "1": "d",
    "2": "p",
    "3": "v",
    "4": "xc",
    "5": "u",
    "6": "group",
    "7": "r",
    "8": "f",
    "9": "w",
    "10": "env",
    "11": "n",
    "12": "doc",
    "13": "a",
    "14": "act",
    "15": "loc",
    "16": "vn",
    "17": "conj",
    "18": "ins",
    "19": "hy",
    "20": "pro",
    "21": "time",
    "22": "gov",
    "23": "med",
    "24": "b",
    "25": "c",
    "26": "com",
    "27": "m",
    "28": "means",
    "29": "microbe",
    "30": "plant",
    "31": "phe",
    "32": "ord",
    "33": "animal",
    "34": "q",
    "35": "desease",
    "36": "per",
    "37": "policy",
    "38": "event",
    "39": "meet",
    "40": "code",
    "41": "org"
  },
  "id2label": {
    "0": "O",
    "1": "B-pol",
    "2": "I-pol",
    "3": "E-pol",
    "4": "S-pol",
    "5": "B-d",
    "6": "I-d",
    "7": "E-d",
    "8": "S-d",
    "9": "B-p",
    "10": "I-p",
    "11": "E-p",
    "12": "S-p",
    "13": "B-v",
    "14": "I-v",
    "15": "E-v",
    "16": "S-v",
    "17": "B-xc",
    "18": "I-xc",
    "19": "E-xc",
    "20": "S-xc",
    "21": "B-u",
    "22": "I-u",
    "23": "E-u",
    "24": "S-u",
    "25": "B-group",
    "26": "I-group",
    "27": "E-group",
    "28": "S-group",
    "29": "B-r",
    "30": "I-r",
    "31": "E-r",
    "32": "S-r",
    "33": "B-f",
    "34": "I-f",
    "35": "E-f",
    "36": "S-f",
    "37": "B-w",
    "38": "I-w",
    "39": "E-w",
    "40": "S-w",
    "41": "B-env",
    "42": "I-env",
    "43": "E-env",
    "44": "S-env",
    "45": "B-n",
    "46": "I-n",
    "47": "E-n",
    "48": "S-n",
    "49": "B-doc",
    "50": "I-doc",
    "51": "E-doc",
    "52": "S-doc",
    "53": "B-a",
    "54": "I-a",
    "55": "E-a",
    "56": "S-a",
    "57": "B-act",
    "58": "I-act",
    "59": "E-act",
    "60": "S-act",
    "61": "B-loc",
    "62": "I-loc",
    "63": "E-loc",
    "64": "S-loc",
    "65": "B-vn",
    "66": "I-vn",
    "67": "E-vn",
    "68": "S-vn",
    "69": "B-conj",
    "70": "I-conj",
    "71": "E-conj",
    "72": "S-conj",
    "73": "B-ins",
    "74": "I-ins",
    "75": "E-ins",
    "76": "S-ins",
    "77": "B-hy",
    "78": "I-hy",
    "79": "E-hy",
    "80": "S-hy",
    "81": "B-pro",
    "82": "I-pro",
    "83": "E-pro",
    "84": "S-pro",
    "85": "B-time",
    "86": "I-time",
    "87": "E-time",
    "88": "S-time",
    "89": "B-gov",
    "90": "I-gov",
    "91": "E-gov",
    "92": "S-gov",
    "93": "B-med",
    "94": "I-med",
    "95": "E-med",
    "96": "S-med",
    "97": "B-b",
    "98": "I-b",
    "99": "E-b",
    "100": "S-b",
    "101": "B-c",
    "102": "I-c",
    "103": "E-c",
    "104": "S-c",
    "105": "B-com",
    "106": "I-com",
    "107": "E-com",
    "108": "S-com",
    "109": "B-m",
    "110": "I-m",
    "111": "E-m",
    "112": "S-m",
    "113": "B-means",
    "114": "I-means",
    "115": "E-means",
    "116": "S-means",
    "117": "B-microbe",
    "118": "I-microbe",
    "119": "E-microbe",
    "120": "S-microbe",
    "121": "B-plant",
    "122": "I-plant",
    "123": "E-plant",
    "124": "S-plant",
    "125": "B-phe",
    "126": "I-phe",
    "127": "E-phe",
    "128": "S-phe",
    "129": "B-ord",
    "130": "I-ord",
    "131": "E-ord",
    "132": "S-ord",
    "133": "B-animal",
    "134": "I-animal",
    "135": "E-animal",
    "136": "S-animal",
    "137": "B-q",
    "138": "I-q",
    "139": "E-q",
    "140": "S-q",
    "141": "B-desease",
    "142": "I-desease",
    "143": "E-desease",
    "144": "S-desease",
    "145": "B-per",
    "146": "I-per",
    "147": "E-per",
    "148": "S-per",
    "149": "B-policy",
    "150": "I-policy",
    "151": "E-policy",
    "152": "S-policy",
    "153": "B-event",
    "154": "I-event",
    "155": "E-event",
    "156": "S-event",
    "157": "B-meet",
    "158": "I-meet",
    "159": "E-meet",
    "160": "S-meet",
    "161": "B-code",
    "162": "I-code",
    "163": "E-code",
    "164": "S-code",
    "165": "B-org",
    "166": "I-org",
    "167": "E-org",
    "168": "S-org"
  },
  "initializer_range": 0.02,
  "inner_group_num": 1,
  "intermediate_size": 1248,
  "jieba": false,
  "key_metric": "macro_f1",
  "label2id": {
    "B-a": 53,
    "B-act": 57,
    "B-animal": 133,
    "B-b": 97,
    "B-c": 101,
    "B-code": 161,
    "B-com": 105,
    "B-conj": 69,
    "B-d": 5,
    "B-desease": 141,
    "B-doc": 49,
    "B-env": 41,
    "B-event": 153,
    "B-f": 33,
    "B-gov": 89,
    "B-group": 25,
    "B-hy": 77,
    "B-ins": 73,
    "B-loc": 61,
    "B-m": 109,
    "B-means": 113,
    "B-med": 93,
    "B-meet": 157,
    "B-microbe": 117,
    "B-n": 45,
    "B-ord": 129,
    "B-org": 165,
    "B-p": 9,
    "B-per": 145,
    "B-phe": 125,
    "B-plant": 121,
    "B-pol": 1,
    "B-policy": 149,
    "B-pro": 81,
    "B-q": 137,
    "B-r": 29,
    "B-time": 85,
    "B-u": 21,
    "B-v": 13,
    "B-vn": 65,
    "B-w": 37,
    "B-xc": 17,
    "E-a": 55,
    "E-act": 59,
    "E-animal": 135,
    "E-b": 99,
    "E-c": 103,
    "E-code": 163,
    "E-com": 107,
    "E-conj": 71,
    "E-d": 7,
    "E-desease": 143,
    "E-doc": 51,
    "E-env": 43,
    "E-event": 155,
    "E-f": 35,
    "E-gov": 91,
    "E-group": 27,
    "E-hy": 79,
    "E-ins": 75,
    "E-loc": 63,
    "E-m": 111,
    "E-means": 115,
    "E-med": 95,
    "E-meet": 159,
    "E-microbe": 119,
    "E-n": 47,
    "E-ord": 131,
    "E-org": 167,
    "E-p": 11,
    "E-per": 147,
    "E-phe": 127,
    "E-plant": 123,
    "E-pol": 3,
    "E-policy": 151,
    "E-pro": 83,
    "E-q": 139,
    "E-r": 31,
    "E-time": 87,
    "E-u": 23,
    "E-v": 15,
    "E-vn": 67,
    "E-w": 39,
    "E-xc": 19,
    "I-a": 54,
    "I-act": 58,
    "I-animal": 134,
    "I-b": 98,
    "I-c": 102,
    "I-code": 162,
    "I-com": 106,
    "I-conj": 70,
    "I-d": 6,
    "I-desease": 142,
    "I-doc": 50,
    "I-env": 42,
    "I-event": 154,
    "I-f": 34,
    "I-gov": 90,
    "I-group": 26,
    "I-hy": 78,
    "I-ins": 74,
    "I-loc": 62,
    "I-m": 110,
    "I-means": 114,
    "I-med": 94,
    "I-meet": 158,
    "I-microbe": 118,
    "I-n": 46,
    "I-ord": 130,
    "I-org": 166,
    "I-p": 10,
    "I-per": 146,
    "I-phe": 126,
    "I-plant": 122,
    "I-pol": 2,
    "I-policy": 150,
    "I-pro": 82,
    "I-q": 138,
    "I-r": 30,
    "I-time": 86,
    "I-u": 22,
    "I-v": 14,
    "I-vn": 66,
    "I-w": 38,
    "I-xc": 18,
    "O": 0,
    "S-a": 56,
    "S-act": 60,
    "S-animal": 136,
    "S-b": 100,
    "S-c": 104,
    "S-code": 164,
    "S-com": 108,
    "S-conj": 72,
    "S-d": 8,
    "S-desease": 144,
    "S-doc": 52,
    "S-env": 44,
    "S-event": 156,
    "S-f": 36,
    "S-gov": 92,
    "S-group": 28,
    "S-hy": 80,
    "S-ins": 76,
    "S-loc": 64,
    "S-m": 112,
    "S-means": 116,
    "S-med": 96,
    "S-meet": 160,
    "S-microbe": 120,
    "S-n": 48,
    "S-ord": 132,
    "S-org": 168,
    "S-p": 12,
    "S-per": 148,
    "S-phe": 128,
    "S-plant": 124,
    "S-pol": 4,
    "S-policy": 152,
    "S-pro": 84,
    "S-q": 140,
    "S-r": 32,
    "S-time": 88,
    "S-u": 24,
    "S-v": 16,
    "S-vn": 68,
    "S-w": 40,
    "S-xc": 20
  },
  "labels": [
    "O",
    "B-pol",
    "I-pol",
    "E-pol",
    "S-pol",
    "B-d",
    "I-d",
    "E-d",
    "S-d",
    "B-p",
    "I-p",
    "E-p",
    "S-p",
    "B-v",
    "I-v",
    "E-v",
    "S-v",
    "B-xc",
    "I-xc",
    "E-xc",
    "S-xc",
    "B-u",
    "I-u",
    "E-u",
    "S-u",
    "B-group",
    "I-group",
    "E-group",
    "S-group",
    "B-r",
    "I-r",
    "E-r",
    "S-r",
    "B-f",
    "I-f",
    "E-f",
    "S-f",
    "B-w",
    "I-w",
    "E-w",
    "S-w",
    "B-env",
    "I-env",
    "E-env",
    "S-env",
    "B-n",
    "I-n",
    "E-n",
    "S-n",
    "B-doc",
    "I-doc",
    "E-doc",
    "S-doc",
    "B-a",
    "I-a",
    "E-a",
    "S-a",
    "B-act",
    "I-act",
    "E-act",
    "S-act",
    "B-loc",
    "I-loc",
    "E-loc",
    "S-loc",
    "B-vn",
    "I-vn",
    "E-vn",
    "S-vn",
    "B-conj",
    "I-conj",
    "E-conj",
    "S-conj",
    "B-ins",
    "I-ins",
    "E-ins",
    "S-ins",
    "B-hy",
    "I-hy",
    "E-hy",
    "S-hy",
    "B-pro",
    "I-pro",
    "E-pro",
    "S-pro",
    "B-time",
    "I-time",
    "E-time",
    "S-time",
    "B-gov",
    "I-gov",
    "E-gov",
    "S-gov",
    "B-med",
    "I-med",
    "E-med",
    "S-med",
    "B-b",
    "I-b",
    "E-b",
    "S-b",
    "B-c",
    "I-c",
    "E-c",
    "S-c",
    "B-com",
    "I-com",
    "E-com",
    "S-com",
    "B-m",
    "I-m",
    "E-m",
    "S-m",
    "B-means",
    "I-means",
    "E-means",
    "S-means",
    "B-microbe",
    "I-microbe",
    "E-microbe",
    "S-microbe",
    "B-plant",
    "I-plant",
    "E-plant",
    "S-plant",
    "B-phe",
    "I-phe",
    "E-phe",
    "S-phe",
    "B-ord",
    "I-ord",
    "E-ord",
    "S-ord",
    "B-animal",
    "I-animal",
    "E-animal",
    "S-animal",
    "B-q",
    "I-q",
    "E-q",
    "S-q",
    "B-desease",
    "I-desease",
    "E-desease",
    "S-desease",
    "B-per",
    "I-per",
    "E-per",
    "S-per",
    "B-policy",
    "I-policy",
    "E-policy",
    "S-policy",
    "B-event",
    "I-event",
    "E-event",
    "S-event",
    "B-meet",
    "I-meet",
    "E-meet",
    "S-meet",
    "B-code",
    "I-code",
    "E-code",
    "S-code",
    "B-org",
    "I-org",
    "E-org",
    "S-org"
  ],
  "layer_norm_eps": 1e-12,
  "liscence": "Apache Lisence",
  "max_length": 510,
  "max_position_embeddings": 512,
  "model_type": "albert",
  "ner_encoding": "BIOES",
  "net_structure_type": 0,
  "num_attention_heads": 12,
  "num_entities": 42,
  "num_hidden_groups": 1,
  "num_hidden_layers": 4,
  "num_memory_blocks": 0,
  "num_test_texts": 0,
  "num_train_texts": 27500,
  "num_valid_texts": 6845,
  "package": "envtext",
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "resampling": 4,
  "resampling_ratio": 4,
  "torch_dtype": "float32",
  "transformers_version": "4.22.1",
  "type_vocab_size": 2,
  "visualizer": "entity",
  "vocab_size": 21128
}
